openFoam_dpdt/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "/home/thk/openfoam_opencfs_coupling/precice-config_dpdt.xml";

participant openFOAM;

modules (FF);

interfaces
{
  Interface1
  {
    mesh              openFOAMMesh;
    patches           (inlet);
    locations         volumeCenters;

    readData
    (
    );

    writeData
    (
      PressureTemporalDerivative
    );
  };
};

